Repository: 1PlaceNZ/jboss-seam
Catalog: doc/Seam_Reference_Guide/*/Preface.po
Languages: it_it, ja_jp

source: Introduction to JBoss Seam
it_it: Introduzione a JBoss Seam
ja_jp: JBoss Seam の紹介

source: Seam is an application framework for Enterprise Java. It is inspired by the following principles:
it_it: Seam è un'application framework per Java Enterprise. E' ispirato dai seguenti principi:
ja_jp: Seam は、エンタープライズ Java 向けのアプリケーションフレームワークです。以下のような原則に開発意欲を奮起 (インスパイア) されました:

source: One kind of "stuff"
it_it: Unico tipo di "cosa"
ja_jp: 一種類の "材料" (一貫したコンポーネントモデル)

source: Seam defines a uniform component model for all business logic in your application. A Seam component may be stateful, with the state associated with any one of several well-defined contexts, including the long-running, persistent, <emphasis>business process context</emphasis> and the <emphasis>conversation context</emphasis>, which is preserved across multiple web requests in a user interaction.
it_it: Seam definisce un modello uniforme a componenti per tutte le business logic nella tua applicazione. Un componente Seam può essere stateful, con uno stato associato ad uno dei tanti contesti ben-definiti, che includono long-running, persistenza, <emphasis>contesto processo di business</emphasis> e il <emphasis>contesto conversazionale</emphasis>, che viene preservato lungo le richieste web multiple nell'interazione con l'utente.
ja_jp: Seam は、アプリケーションのすべてのビジネスロジックのために一貫したコンポーネントモデルを定義します。Seam コンポーネントは、明確に定義された数種類のコンテキストの一つに関係付けられた状態を持つステートフルなものであるかもしれません。これらのコンテキストには、長時間に渡って実行され永続化される <emphasis>ビジネスプロセスコンテキスト</emphasis> や、複数の Web リクエストに跨る一連のユーザインタラクション間で保持される <emphasis>対話コンテキスト</emphasis> が含まれます。

source: There is no distinction between presentation tier components and business logic components in Seam. You can layer your application according to whatever architecture you devise, rather than being forced to shoehorn your application logic into an unnatural layering scheme forced upon you by whatever combination of stovepipe frameworks you're using today.
it_it: Non c'è alcuna distinzione in Seam tra i componenti del livello presentazione ed i componenti di business logic. Puoi stratificare la tua applicazione secondo una qualsiasi architettura a tuo piacimento, piuttosto che essere forzato a modellare la logica dell'applicazione in uno schema innaturale con una qualsiasi combinazione di framework aggrovigliati che stai usando oggi.
ja_jp: Seam においては、プレゼンテーション層コンポーネントとビジネスロジック層コンポーネントとに区別はありません。アプリケーションを自分で工夫したどんなアーキテクチャにも則って階層化することができます。今日使用している煙突型(スタック型)フレームワークのいかなる組み合わせによっても要求される不自然な階層化構造に、アプリケーションロジックを詰め込むようなことは強制されません。

source: Unlike plain Java EE or J2EE components, Seam components may <emphasis>simultaneously</emphasis> access state associated with the web request and state held in transactional resources (without the need to propagate web request state manually via method parameters). You might object that the application layering imposed upon you by the old J2EE platform was a Good Thing. Well, nothing stops you creating an equivalent layered architecture using Seam&#8212;the difference is that <emphasis>you</emphasis> get to architect your own application and decide what the layers are and how they work together.
it_it: A differenza dei componenti J2EE o del semplice Java EE, i componenti Seam possono <emphasis>simultaneamente</emphasis> accedere allo stato associato allarichiesta web e allo stato mantenuto nelle risorse transazionali (senza il bisogno di propagare manualmente lo stato della richiesta web attraverso i parametri). Si potrebbe obbiettare che la stratificazione dell'applicazione impostadalla vecchia piattaforma J2EE fosse una Cosa Buona. Bene, niente ti vieta di creare un'architettura a strati equivalente usando Seam&#8212; la differenza è che <emphasis>tu</emphasis> decidi l'architettura della tua applicazione e decidi quali sono i layer e come lavorano assieme
ja_jp: 単純な Java EE あるいは J2EE コンポーネントと違って、Seam コンポーネントは、(メソッドパラメータによって Web リクエスト状態を手動で引き継ぐことがなくても) Web リクエストに関連した状態やトランザクションリソースに保持された状態に <emphasis>同時に</emphasis> アクセスすることがあるかもしれません。古い J2EE プラットホームによって強制されたアプリケーションの階層化の方が良い方法だったと反論するかもしれません。そうです、何も Seam を利用して同等の階層化アーキテクチャを開発するのを止めたりはしません &#8212; 違いは、<emphasis>開発者</emphasis> が自分自身のアプリケーションのアーキテクチャを設計できるようになり、階層はどうあるべきで、それらがどう連携して動作すべきかを決定するということなのです。

source: Integrate JSF with EJB 3.0
it_it: Integrazione di JSF con EJB 3.0
ja_jp: JSF と EJB 3.0 の統合

source: JSF and EJB 3.0 are two of the best new features of Java EE 5. EJB3 is a brand new component model for server side business and persistence logic. Meanwhile, JSF is a great component model for the presentation tier. Unfortunately, neither component model is able to solve all problems in computing by itself. Indeed, JSF and EJB3 work best used together. But the Java EE 5 specification provides no standard way to integrate the two component models. Fortunately, the creators of both models foresaw this situation and provided standard extension points to allow extension and integration with other frameworks.
ja_jp: JSF と EJB 3.0 は、Java EE 5 の最も素晴らしい2つの新機能です。EJB3 は、サーバサイドのビジネスロジックと永続化ロジックのための全く新しいコンポーネントモデルです。一方、JSF はプレゼンテーション層のための優れたコンポーネントモデルです。残念なことに、どちらのコンポーネントモデルも片方だけではすべてのコンピューティング問題を解決することはできません。その代わりに、JSF と EJB3 を一緒に使用すれば最も良く働かせることができます。しかし、Java EE 5 仕様では、2つのコンポーネントモデルを統合するための標準的な方法を提供していません。幸いにも、両方のモデルの策定者はこの状況を予見していて、モデルを拡張したり他のフレームワークと統合したりを可能にするための標準拡張ポイントを提供しています。

source: Seam unifies the component models of JSF and EJB3, eliminating glue code, and letting the developer think about the business problem.
it_it: Seam unifica i modelli a componenti di JSF e EJB3, eliminando il codice colla, e consentendo allo sciluppatore di pensare al problema di business.
ja_jp: Seam は JSFと EJB3 のコンポーネントモデルを統一し、 コンポーネント間の接着剤としてのコード (glue code) を取り除き、開発者がビジネス関連の問題解決に重点を置けるようにしてくれます。

source: It is possible to write Seam applications where "everything" is an EJB. This may come as a surprise if you're used to thinking of EJBs as coarse-grained, so-called "heavyweight" objects. However, version 3.0 has completely changed the nature of EJB from the point of view of the developer. An EJB is a fine-grained object&#8212;nothing more complex than an annotated JavaBean. Seam even encourages you to use session beans as JSF action listeners!
ja_jp: Seam アプリケーションでは、 "すべて"を EJB で記述することが可能です。EJB は粗粒度のいわゆる "重量 (heavyweight)" のオブジェクトであると考えるのに慣れている人にとっては、驚きかもしれません。しかし、EJB のバージョン 3.0 は、開発者の観点から完全にその性質を変えました。EJB は、細粒度のオブジェクトです &#8212; 単なるアノテーション付きの JavaBeans に過ぎないのです。Seam は、JSF アクションリスナとしてセッション Bean を使用することさえ奨励します!

source: On the other hand, if you prefer not to adopt EJB 3.0 at this time, you don't have to. Virtually any Java class may be a Seam component, and Seam provides all the functionality that you expect from a "lightweight" container, and more, for any component, EJB or otherwise.
it_it: Dall'altro lato, se preferisci non adottare EJB 3.0 adesso, puoi non farlo. Virtualmente ogni classe java può essere un componente Seam, e Seam fornisce tutte le funzionalità che ci si attende da un "lightweight" container, ed in più, per ogni componente, EJB o altro.
ja_jp: 一方で、もし現時点では EJB 3.0 を採用しない方を好めば、EJB 3.0 を使用する必要はありません。事実上はどんな Java クラスでも、Seam コンポーネントになることができます。さらに Seam は、EJB であろうとなかろうといかなるコンポーネントに対しても、"軽量 (lightweight)" コンテナに期待されるすべての機能を提供します。

source: Integrated AJAX
it_it: AJAX integrato
ja_jp: 統合 AJAX

source: Seam supports the best open source JSF-based AJAX solutions: JBoss RichFaces and ICEfaces. These solutions let you add AJAX capability to your user interface without the need to write any JavaScript code.
it_it: Seam supporta le migliori soluzioni open source AJAX basate su JSF: JBoss RichFaces a ICEFaces. Queste soluzioni ti permettono di aggiungere funzionalità AJAX alla tua interfaccia utente senza il bisogno di scrivere codice JavaScript.
ja_jp: Seamは、最も素晴らしいオープンソースの JSF ベース AJAX ソリューション: JBoss RichFaces と ICEfaces をサポートします。これらのソリューションは、一切 JavaScript コードを記述する必要なしで、ユーザインタフェースに AJAX 機能を追加させることができます。

source: Alternatively, Seam provides a built-in JavaScript remoting layer that lets you call components asynchronously from client-side JavaScript without the need for an intermediate action layer. You can even subscribe to server-side JMS topics and receive messages via AJAX push.
it_it: In alternativa Seam fornisce al suo interno uno strato remoto di JavaScript che ti consente di chiamare i componenti in modo asincrono da JavaScript lato client senza il bisogno di uno strato di azione intermedio. Puoi anche sottoscrivere topic JMS lato server e ricevere messaggi tramite push AJAX.
ja_jp: もう一つの方法として、Seam は組み込みの JavaScript リモーティングレイヤを提供していて、中間のアクションレイヤを必要とせずに、クライアント側の JavaScript から非同期にコンポーネントと呼び出すことができます。サーバ側の JMS トピックをサブスクライブして、AJAX プッシュによってメッセージを受信することもできます。

source: Neither of these approaches would work well, were it not for Seam's built-in concurrency and state management, which ensures that many concurrent fine-grained, asynchronous AJAX requests are handled safely and efficiently on the server side.
it_it: Nessuno di questi approcci funzionerebbe bene, se non fosse per la gestione interna di Seam della concorrenza e dello stato, la quale assicura che molte richieste (fine-grained) AJAX concorrenti e asincrone vengano gestite in modo sicuro ed efficiente lato server.
ja_jp: これらのアプローチのどちらも、Seam の組み込みの並行処理制御や状態管理に対してのものではないので、それらの機能に対してはうまく動作しません。しかし、並列に実行される多くの細粒度の非同期の AJAX リクエストがサーバサイドで安全にそして効率的に処理されるということを保証します。

source: Business process as a first class construct
it_it: Processo di business come primo costrutto di classe
ja_jp: 一級構成要素としてのビジネスプロセス

source: Optionally, Seam provides transparent business process management via jBPM. You won't believe how easy it is to implement complex workflows, collaboration and and task management using jBPM and Seam.
it_it: Opzionalmente Seam può fornire una gestione trasparente di processo di business tramire jBPM. Non ci crederai quanto è facile implementare workflow complessi, collaborazioni e gestione dei compiti utilizzando jBPM e Seam.
ja_jp: オプションとして、Seam は jBPM による透過的なビジネスプロセス管理を提供します。jBPM と Seam を利用した複雑なワークフロー、コラボレーション、タスク管理の実装がいかに簡単であるか信じられないことでしょう。

source: Seam even allows you to define presentation tier pageflow using the same language (jPDL) that jBPM uses for business process definition.
it_it: Seam consente pure di definire il pageflow del livello di presentazione utilizzando lo stesso linguaggio (jPDL) che jBPM utilizza per la definizione dei processi di business.
ja_jp: Seam は、jBPM がビジネスプロセス定義に使用するのと同じ言語 (jPDL) をプレゼンテーション層のページフローの定義にも利用することを可能にします。

source: JSF provides an incredibly rich event model for the presentation tier. Seam enhances this model by exposing jBPM's business process related events via exactly the same event handling mechanism, providing a uniform event model for Seam's uniform component model.
ja_jp: JSFは、プレゼンテーション層のために信じられないほど豊富なイベントモデルを提供します。Seam の一貫したコンポーネントモデルに対して一貫したイベントモデルを提供することにより、Seam は全く同様のイベント処理メカニズムを jBPM のビジネスプロセス関連イベントにも適用するによってこのモデルを改良します。

source: Declarative state management
it_it: Gestione dichiarativa dello stato
ja_jp: 宣言的な状態管理

source: We're all used to the concept of declarative transaction management and declarative security from the early days of EJB. EJB 3.0 even introduces declarative persistence context management. These are three examples of a broader problem of managing state that is associated with a particular <emphasis>context</emphasis>, while ensuring that all needed cleanup occurs when the context ends. Seam takes the concept of declarative state management much further and applies it to <emphasis>application state</emphasis>. Traditionally, J2EE applications implement state management manually, by getting and setting servlet session and request attributes. This approach to state management is the source of many bugs and memory leaks when applications fail to clean up session attributes, or when session data associated with different workflows collides in a multi-window application. Seam has the potential to almost entirely eliminate this class of bugs.
it_it: Siamo tutti abituati al concetto di gestione dichiarativa delle transazioni e sicurezza dichiarativa fin dai primi giorni di EJB. EJB3 introduce anche la gestione dichiarativa del contesto di persistenza. Ci sono tre esempi di un ampio problema di gestione dello stato che è associato ad un particolare <emphasis>contesto</emphasis>, mentre tutte i dovuti cleanup avvengono quando il contesto termina. Seam porta oltre il concetto di gestione dichiarativa dello stato e lo applica allo <emphasis>stato dell'applicazione</emphasis>. Tradizionalmente le applicazioni J2EE implementano manualmente la gestione dello stato con il get e set della sessione servlet e degli attributi di richiesta. Questo approccio alla gestione dello stato è l'origine di molti bug e memory leak quando l'applicazione non riesce a pulire gli attributi di sessione, o quando i dati di sessione associati a diversi workflow collidono all'interno di un'applicazione multi-finestra. Seam ha il potenziale per eliminare quasi interamente questa classe di bug.
ja_jp: EJB は初期の頃から、宣言的なトランザクション管理と宣言的なセキュリティのコンセプトを採用しています。EJB 3.0 では、宣言的な永続化コンテキスト管理さえも導入します。これら３つは、特定の<emphasis>コンテキスト</emphasis>に関連付けられたより広範囲での状態管理の問題の例で、コンテキストが終わるときには、それらはすべての確実に破棄することが必要となります。Seamは、宣言的な状態管理のコンセプトをはるかに広く捉えて、<emphasis>アプリケーション状態</emphasis>にもそれを適用します。伝統的にJ2EE アプリケーションでは、サーブレットセッションとリクエスト属性を 保存 (set) そして取得 (get) することによって、状態管理を手動で実装します。状態管理に対するこの手法は、アプリケーションがセッション属性をきれいにし損ねたり、あるいは異なるワークフローに関連したセッションデータが複数ウィンドウのアプリケーションで衝突したりしたときに、多くのバグとメモリリークの発生源となります。Seam には、この種類のバグをほとんど完全に削除できる潜在能力があります。

source: Declarative application state management is made possible by the richness of the <emphasis>context model</emphasis> defined by Seam. Seam extends the context model defined by the servlet spec&#8212;request, session, application&#8212;with two new contexts&#8212;conversation and business process&#8212;that are more meaningful from the point of view of the business logic.
ja_jp: 宣言的なアプリケーションの状態管理は、Seam によって定義された豊富な<emphasis>コンテキストモデル</emphasis>によって可能となります。Seamは、サーブレット仕様によって定義されたコンテキストモデル &#8212; リクエスト、セッション、アプリケーション&#8212; を拡張して、ビジネスロジックの観点からより意味のある２つの新しいコンテキスト &#8212; 対話とビジネスプロセス &#8212; を提供します。

source: You'll be amazed at how many things become easier once you start using conversations. Have you ever suffered pain dealing with lazy association fetching in an ORM solution like Hibernate or JPA? Seam's conversation-scoped persistence contexts mean you'll rarely have to see a <literal>LazyInitializationException</literal>. Have you ever had problems with the refresh button? The back button? With duplicate form submission? With propagating messages across a post-then-redirect? Seam's conversation management solves these problems without you even needing to really think about them. They're all symptoms of the broken state management architecture that has been prevalent since the earliest days of the web.
it_it: Resterai stupito di come molte cose divengano più semplici non appena inizia ad usare le conversazioni. Hai mai sofferto nell'utilizzo dell'associazione lazy in una soluzione ORM come Hibernate o JPA? I contesti di Seam di persistenza basati sulle conversazioni ti consentiranno di vedere raramente una <literal>LazyInitializationException</literal>. Hai mai avuto problemi con il pulsante di aggiornamento? Con il pulsante indietro? Con una form inviata due volte? Con la propagazione di messaggi attraverso un post-then-redirect? La gestione delle conversazioni di Seam risolve questi problemi senza che tu debba pensarci. Questi sono tutti sintomi di un'architettura errata di gestione dello stato che è stata prevalente fin dai primi giorni della comparsa del web.
ja_jp: 対話コンテキストを利用し始めると、いかに多くのことがより簡単になるか驚かされるでしょう。Hibernate あるいは JPA のような ORM ソリューションで遅延関連フェッチを利用して、障害を経験したことがありませんか? Seam の対話スコープ永続化コンテキストを使用すると、めったに <literal>LazyInitializationException</literal> を見ることがなくなるということになります。リフレッシュボタンで問題が発生したことがありませんか? 戻るボタンで問題が発生したことがありません? 送信フォームの二重送信で問題が発生したことがありません? post-then-redirect を跨ったメッセージ引継ぎで問題が発生したことがありません? Seam の対話管理は、これらの問題を個別に考える必要なしに解決します。これらはすべて、Web の最も初期の頃以来蔓延している中途半端な状態管理アーキテクチャが原因の症状なのです。

source: Bijection
ja_jp: バイジェクション

source: The notion of <emphasis>Inversion of Control</emphasis> or <emphasis>dependency injection</emphasis> exists in both JSF and EJB3, as well as in numerous so-called "lightweight containers". Most of these containers emphasize injection of components that implement <emphasis>stateless services</emphasis>. Even when injection of stateful components is supported (such as in JSF), it is virtually useless for handling application state because the scope of the stateful component cannot be defined with sufficient flexibility, and because components belonging to wider scopes may not be injected into components belonging to narrower scopes.
ja_jp: <emphasis>制御の反転 (IoC: Inversion of Control)</emphasis> あるいは <emphasis>依存性注入 (DI: Dependency Injection)</emphasis> の概念は、多くのいわゆる"軽量コンテナ (lightweight container)"と同様に、JSF と EJB3 の両方に存在します。これらのコンテナのほとんどは、<emphasis>ステートレスなサービス</emphasis> を実装するコンポーネントのインジェクションに力点が置かれています。たとえステートフルなコンポーネントのインジェクションがサポートされるとていたとしても (例えば JSF において)、アプリケーション状態を扱う場合においては事実上役に立ちません。なぜならば、ステートフルなコンポーネントのスコープが十分な柔軟性を持って定義されていないので、より広いスコープに属しているコンポーネントをより狭いスコープに属するコンポーネントへインジェクションすることができないからです。

source: <emphasis>Bijection</emphasis> differs from IoC in that it is <emphasis>dynamic</emphasis>, <emphasis>contextual</emphasis>, and <emphasis>bidirectional</emphasis>. You can think of it as a mechanism for aliasing contextual variables (names in the various contexts bound to the current thread) to attributes of the component. Bijection allows auto-assembly of stateful components by the container. It even allows a component to safely and easily manipulate the value of a context variable, just by assigning it to an attribute of the component.
it_it: La <emphasis>Bijection</emphasis> differisce da IoC poiché è <emphasis>dinamiac</emphasis>, <emphasis>contestuale</emphasis>, e <emphasis>bidirezionale</emphasis>. Puoi pensare ad essa come un meccanismo per la denominazione di variabili contestuali (nomi in vari contesti legati all thread attuale) in attributi dei componenti. La bijection consente l'autoassemblamento dei componenti da parte del container. Permette pure che un componente possa in tutta sicurezza e semplicità manipolare il valore di una variabile di contesto, solamente assegnandola ad un attributo del componente.
ja_jp: <emphasis>バイジェクション (Bijection)</emphasis> は、それが<emphasis>動的</emphasis>であり、<emphasis>コンテキスト依存</emphasis>であり、そして<emphasis>双方向的</emphasis>であるという点で IoC とは異なります。コンテキスト上の変数(現在のスレッドに括り付けられた様々なコンテキストでの名前)をコンポーネントの属性にエイリアスするためのメカニズムだと考えることができます。バイジェクションは、コンテナによるステートフルなコンポーネントの自動アセンブリを可能にします。それは、ちょうどコンポーネントの属性に割り当てることによって、コンポーネントが安全にそして簡単にコンテキスト変数の値を操作することをまさに可能にします。

source: Workspace management and multi-window browsing
it_it: Gestione del workspace e navigazione multi-finestra
ja_jp: ワークスペース管理と複数ウィンドウアクセス

source: Seam applications let the user freely switch between multiple browser tabs, each associated with a different, safely isolated, conversation. Applications may even take advantage of <emphasis>workspace management</emphasis>, allowing the user to switch between conversations (workspaces) in a single browser tab. Seam provides not only correct multi-window operation, but also multi-window-like operation in a single window!
ja_jp: Seam アプリケーションは、それぞれが別々の安全に分離された対話に関連付けられた複数のブラウザタブ間を、ユーザが自由にスイッチすることを可能にします。アプリケーションは、さらに<emphasis>ワークスペース管理</emphasis>を利用して、一つのブラウザタブ内で対話 (ワークスペース) の間をユーザがスイッチすることも可能にします。Seam は、正しい複数ウィンドウの操作のみを提供するのではなく、一つのウィンドウ内での複数ウィンドウ風の操作も提供するのです!

source: Prefer annotations to XML
it_it: Preferenza delle annotazioni all'XML
ja_jp: XMLよりもアノテーションの方が好き

source: Traditionally, the Java community has been in a state of deep confusion about precisely what kinds of meta-information counts as configuration. J2EE and popular "lightweight" containers have provided XML-based deployment descriptors both for things which are truly configurable between different deployments of the system, and for any other kinds or declaration which can not easily be expressed in Java. Java 5 annotations changed all this.
ja_jp: 伝統的にJavaコミュニティは、どのような種類のメタ情報をコンフィグレーションとして考慮すべきかについて深い混乱の状態にいました。J2EE と人気がある "軽量の (lightweight)"コンテナは、XML ベースのデプロイメントディスクリプタを提供し、システムの異なるデプロイメントの間で本当にコンフィグレーションと、Java では簡単に表されることができない宣言との両方をメタ情報として提供しました。Java 5 のアノテーションがこのすべてを変えました。

source: EJB 3.0 embraces annotations and "configuration by exception" as the easiest way to provide information to the container in a declarative form. Unfortunately, JSF is still heavily dependent on verbose XML configuration files. Seam extends the annotations provided by EJB 3.0 with a set of annotations for declarative state management and declarative context demarcation. This lets you eliminate the noisy JSF managed bean declarations and reduce the required XML to just that information which truly belongs in XML (the JSF navigation rules).
ja_jp: EJB 3.0 は、 宣言的な形式でコンテナに情報を提供する最も簡単な方法としてアノテーションと"例外による設定"を採用しています。 残念ながら、 JSF はまだ冗長な XML 設定ファイルに大きく依存しています。 Seam は、 EJB 3.0 によって提供されるアノテーションに宣言的状態管理および宣言的コンテキスト区分用のアノテーション一式を提供することにより機能拡張しています。 これにより、 うっとうしい JSF 管理の Bean 宣言を取り除き、 必要とされる XML を減少させ、本当に XML で定義すべき情報 (JSF ナビゲーション規則) だけになるようにします。

source: Integration testing is easy
it_it: I test d'integrazione sono facili
ja_jp: 結合テストを簡単に

source: Seam components, being plain Java classes, are by nature unit testable. But for complex applications, unit testing alone is insufficient. Integration testing has traditionally been a messy and difficult task for Java web applications. Therefore, Seam provides for testability of Seam applications as a core feature of the framework. You can easily write JUnit or TestNG tests that reproduce a whole interaction with a user, exercising all components of the system apart from the view (the JSP or Facelets page). You can run these tests directly inside your IDE, where Seam will automatically deploy EJB components using JBoss Embedded.
ja_jp: Seam コンポーネントは、単純な Java クラスであって、本来ユニットテストで十分テストできるものです。しかし複雑なアプリケーションでは、ユニットテストだけは不十分です。伝統的にJava の Web アプリケーションにおいては、結合テストは繁雑で困難な作業でした。それゆえに、Seam はフレームワークのコア機能として、Seam アプリケーションのテスト機能を提供します。システムのすべてのコンポーネントをビュー (JSP ページまたは Facelets ページ)から切り離して動作させることにより、ユーザとのすべての相互作用を再現する JUnit あるいは TestNG のテストを簡単に記述することができます。これらのテストを直接 IDE の内部で実行することができます。そこでは、Seam が 組み込み型 JBoss を利用して EJB コンポーネントを自動的にデプロイします。

source: The specs ain't perfect
it_it: Le specifiche non sono perfette
ja_jp: 仕様は完璧ではない

source: We think the latest incarnation of Java EE is great. But we know it's never going to be perfect. Where there are holes in the specifications (for example, limitations in the JSF lifecycle for GET requests), Seam fixes them. And the authors of Seam are working with the JCP expert groups to make sure those fixes make their way back into the next revision of the standards.
ja_jp: Java EEの最新の実装は素晴らしいと思います。しかし、それが決して完全ではないということも知っています。どの仕様にも欠点はあるので(例えば、GET リクエストにおける JSF ライフサイクルの制限)、Seam はそれを修正します。Seam の作者らは、JCP エキスパートグループと一緒に活動していて、それらの修正が標準仕様の次の改訂版に確実に反映されるようにしています。

source: There's more to a web application than serving HTML pages
it_it: Una web application non genera soltanto pagine html ma fa molto di più
ja_jp: WebアプリケーションにはHTMLページを供給すること以上の役割がある
